In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
base_path = ''

In [2]:
tr = pd.read_csv(base_path + 'tr31004.csv')

df = pd.read_csv(base_path + 'datepayamt.csv')

time = pd.read_csv(base_path + '1006timetest.csv')

In [3]:
tr

           SAL_DT SALE_KIND_TP_NM  SALE_RTN_SGN  REAL_SAL_TTM    PAY_AMT
0        20210901              매출             1         71138  9000000.0
1        20210901              매출             1         91245     3650.0
2        20210901              매출             1         91549     1970.0
3        20210901              매출             1         91647     3980.0
4        20210901              매출             1         92226    12500.0
...           ...             ...           ...           ...        ...
1479464  20220901              매출             1        142845     7400.0
1479465  20220901              매출             1        143105     9000.0
1479466  20220901              매출             1        143132    11000.0
1479467  20220901              매출             1        143433      500.0
1479468  20220901              매출             1        143610     1900.0

[1479469 rows x 5 columns]

In [4]:
tr.SAL_DT = tr.SAL_DT.astype('str')
tr.SAL_DT

0          20210901
1          20210901
2          20210901
3          20210901
4          20210901
             ...
1479464    20220901
1479465    20220901
1479466    20220901
1479467    20220901
1479468    20220901
Name: SAL_DT, Length: 1479469, dtype: object

In [5]:
tr.SAL_DT = pd.to_datetime(tr.SAL_DT)

tr

            SAL_DT SALE_KIND_TP_NM  SALE_RTN_SGN  REAL_SAL_TTM    PAY_AMT
0       2021-09-01              매출             1         71138  9000000.0
1       2021-09-01              매출             1         91245     3650.0
2       2021-09-01              매출             1         91549     1970.0
3       2021-09-01              매출             1         91647     3980.0
4       2021-09-01              매출             1         92226    12500.0
...            ...             ...           ...           ...        ...
1479464 2022-09-01              매출             1        142845     7400.0
1479465 2022-09-01              매출             1        143105     9000.0
1479466 2022-09-01              매출             1        143132    11000.0
1479467 2022-09-01              매출             1        143433      500.0
1479468 2022-09-01              매출             1        143610     1900.0

[1479469 rows x 5 columns]

In [6]:
tr1 = tr[['SAL_DT', 'REAL_SAL_TTM']]
tr1

            SAL_DT  REAL_SAL_TTM
0       2021-09-01         71138
1       2021-09-01         91245
2       2021-09-01         91549
3       2021-09-01         91647
4       2021-09-01         92226
...            ...           ...
1479464 2022-09-01        142845
1479465 2022-09-01        143105
1479466 2022-09-01        143132
1479467 2022-09-01        143433
1479468 2022-09-01        143610

[1479469 rows x 2 columns]

In [7]:
result7 = pd.concat([tr1, df],axis=1)
print(result7)

            SAL_DT  REAL_SAL_TTM               result    PAY_AMT
0       2021-09-01         71138  2021-09-01 07:11:38  9000000.0
1       2021-09-01         91245  2021-09-01 09:12:45     3650.0
2       2021-09-01         91549  2021-09-01 09:15:49     1970.0
3       2021-09-01         91647  2021-09-01 09:16:47     3980.0
4       2021-09-01         92226  2021-09-01 09:22:26    12500.0
...            ...           ...                  ...        ...
1479464 2022-09-01        142845  2022-09-01 14:28:45     7400.0
1479465 2022-09-01        143105  2022-09-01 14:31:05     9000.0
1479466 2022-09-01        143132  2022-09-01 14:31:32    11000.0
1479467 2022-09-01        143433  2022-09-01 14:34:33      500.0
1479468 2022-09-01        143610  2022-09-01 14:36:10     1900.0

[1479469 rows x 4 columns]

In [8]:
result7

            SAL_DT  REAL_SAL_TTM               result    PAY_AMT
0       2021-09-01         71138  2021-09-01 07:11:38  9000000.0
1       2021-09-01         91245  2021-09-01 09:12:45     3650.0
2       2021-09-01         91549  2021-09-01 09:15:49     1970.0
3       2021-09-01         91647  2021-09-01 09:16:47     3980.0
4       2021-09-01         92226  2021-09-01 09:22:26    12500.0
...            ...           ...                  ...        ...
1479464 2022-09-01        142845  2022-09-01 14:28:45     7400.0
1479465 2022-09-01        143105  2022-09-01 14:31:05     9000.0
1479466 2022-09-01        143132  2022-09-01 14:31:32    11000.0
1479467 2022-09-01        143433  2022-09-01 14:34:33      500.0
1479468 2022-09-01        143610  2022-09-01 14:36:10     1900.0

[1479469 rows x 4 columns]

In [43]:
result8 = result7['SAL_DT']
result8

0         2021-09-01
1         2021-09-01
2         2021-09-01
3         2021-09-01
4         2021-09-01
             ...
1479464   2022-09-01
1479465   2022-09-01
1479466   2022-09-01
1479467   2022-09-01
1479468   2022-09-01
Name: SAL_DT, Length: 1479469, dtype: datetime64[ns]

In [44]:
result8.to_csv('month1006.csv', index=False)

In [9]:
result7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1479469 entries, 0 to 1479468
Data columns (total 4 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   SAL_DT        1479469 non-null  datetime64[ns]
 1   REAL_SAL_TTM  1479469 non-null  int64
 2   result        1479469 non-null  object
 3   PAY_AMT       1479469 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 45.1+ MB

In [10]:
df1 = result7['REAL_SAL_TTM'].astype(str).str.zfill(6)

In [11]:
result7['REAL_SAL_TTM'] = pd.to_datetime(df1, format='%H%M%S').dt.time

print (result7)

            SAL_DT REAL_SAL_TTM               result    PAY_AMT
0       2021-09-01     07:11:38  2021-09-01 07:11:38  9000000.0
1       2021-09-01     09:12:45  2021-09-01 09:12:45     3650.0
2       2021-09-01     09:15:49  2021-09-01 09:15:49     1970.0
3       2021-09-01     09:16:47  2021-09-01 09:16:47     3980.0
4       2021-09-01     09:22:26  2021-09-01 09:22:26    12500.0
...            ...          ...                  ...        ...
1479464 2022-09-01     14:28:45  2022-09-01 14:28:45     7400.0
1479465 2022-09-01     14:31:05  2022-09-01 14:31:05     9000.0
1479466 2022-09-01     14:31:32  2022-09-01 14:31:32    11000.0
1479467 2022-09-01     14:34:33  2022-09-01 14:34:33      500.0
1479468 2022-09-01     14:36:10  2022-09-01 14:36:10     1900.0

[1479469 rows x 4 columns]

In [12]:
result7.dtypes

SAL_DT          datetime64[ns]
REAL_SAL_TTM            object
result                  object
PAY_AMT                float64
dtype: object

In [13]:
result7

            SAL_DT REAL_SAL_TTM               result    PAY_AMT
0       2021-09-01     07:11:38  2021-09-01 07:11:38  9000000.0
1       2021-09-01     09:12:45  2021-09-01 09:12:45     3650.0
2       2021-09-01     09:15:49  2021-09-01 09:15:49     1970.0
3       2021-09-01     09:16:47  2021-09-01 09:16:47     3980.0
4       2021-09-01     09:22:26  2021-09-01 09:22:26    12500.0
...            ...          ...                  ...        ...
1479464 2022-09-01     14:28:45  2022-09-01 14:28:45     7400.0
1479465 2022-09-01     14:31:05  2022-09-01 14:31:05     9000.0
1479466 2022-09-01     14:31:32  2022-09-01 14:31:32    11000.0
1479467 2022-09-01     14:34:33  2022-09-01 14:34:33      500.0
1479468 2022-09-01     14:36:10  2022-09-01 14:36:10     1900.0

[1479469 rows x 4 columns]

In [14]:
result7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1479469 entries, 0 to 1479468
Data columns (total 4 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   SAL_DT        1479469 non-null  datetime64[ns]
 1   REAL_SAL_TTM  1479469 non-null  object
 2   result        1479469 non-null  object
 3   PAY_AMT       1479469 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 45.1+ MB

In [15]:
#result9.to_csv('1006timetest.csv', index=False)

In [16]:
time

        REAL_SAL_TTM
0           07:11:38
1           09:12:45
2           09:15:49
3           09:16:47
4           09:22:26
...              ...
1479464     14:28:45
1479465     14:31:05
1479466     14:31:32
1479467     14:34:33
1479468     14:36:10

[1479469 rows x 1 columns]

In [17]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1479469 entries, 0 to 1479468
Data columns (total 1 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   REAL_SAL_TTM  1479469 non-null  object
dtypes: object(1)
memory usage: 11.3+ MB

In [18]:
time['REAL_SAL_TTM'] = pd.to_datetime(time['REAL_SAL_TTM'], errors='raise')

In [19]:
time

               REAL_SAL_TTM
0       2022-10-06 07:11:38
1       2022-10-06 09:12:45
2       2022-10-06 09:15:49
3       2022-10-06 09:16:47
4       2022-10-06 09:22:26
...                     ...
1479464 2022-10-06 14:28:45
1479465 2022-10-06 14:31:05
1479466 2022-10-06 14:31:32
1479467 2022-10-06 14:34:33
1479468 2022-10-06 14:36:10

[1479469 rows x 1 columns]

In [22]:
import datetime

In [26]:
tr.REAL_SAL_TTM = tr.REAL_SAL_TTM.astype('str')
tr.REAL_SAL_TTM

0           71138
1           91245
2           91549
3           91647
4           92226
            ...
1479464    142845
1479465    143105
1479466    143132
1479467    143433
1479468    143610
Name: REAL_SAL_TTM, Length: 1479469, dtype: object

In [31]:
date_time_str = tr['REAL_SAL_TTM']
date_time_obj = datetime.datetime.strptime(date_time_str, '%H:%M:%S')
date_time_obj

TypeError: strptime() argument 1 must be str, not Series

In [33]:
tr['REAL_SAL_TTM'].astype(str).str.zfill(6)

0          071138
1          091245
2          091549
3          091647
4          092226
            ...
1479464    142845
1479465    143105
1479466    143132
1479467    143433
1479468    143610
Name: REAL_SAL_TTM, Length: 1479469, dtype: object

In [42]:
start_dt = datetime.strptime(start_date, "%d-%m-%Y %H:%M:%S") # convert into datetime fromat
value['start_time'] = datetime.strftime(start_dt, "%H:%M:%S") # convert into string format and extract time only

NameError: name 'start_date' is not defined